from sModule import Student, Students

# ------------------------------------------------------
# Students 객체선언
# ------------------------------------------------------
students=Students()
title=['번호','이름','국어','영어','수학','합계','평균','등수']

# ------------------------------------------------------
# 상단메뉴부분
# ------------------------------------------------------
def tmenu_print(): # 상단메뉴부분
    print(" "*20)
    print("[ 학생성적처리 프로그램 ]")
    print("-"*50)
    print("1. 학생성적입력")
    print("2. 학생성적출력")
    print("0. 프로그램 종료")
    choice=0
    try:
        choice=int(input("원하는 번호를 입력하세요.>> "))
    except Exception as e: print(e)
    return choice

# ------------------------------------------------------
# 1. 학생성적입력 함수선언
# ------------------------------------------------------


