### 1. 로또 프로그램
import random
# 6개 숫자 랜덤 번호 생성
# 6개 입력한 번호 생성
# 당첨번호 확인
# 출력


### 2. (좌표)숫자맞추기 프로그램
import random
# 1차원 리스트 생성 (1~25 숫자)
# 랜덤으로 섞기
# 2차원 리스트에 1차원리스트 값을 넣기
# 번호 입력
# 입력된 번호에 맞는 위치 X표시


### 3. 성적처리 프로그램
# 데이터 생성 (리스트타입의 딕셔너리 데이터 생성)
# 출력화면
# 1. 학생성적입력
#   ㄴ 학생번호 자동생성
#   ㄴ 학생성적입력을 무한반복 실행
#   ㄴ 이전화면 이동 구현
#   ㄴ 점수입력에 대한 체크: 숫자인지 확인, 0~100사이 점수인지 확인
# 2. 학생성적출력
#   ㄴ 상단타이틀 출력 (제목부분)
#   ㄴ 각학생별 성적 출력
# 3. 학생성적수정
#   ㄴ 수정하고자 하는 학생 검색
#   ㄴ 수정하려는 과목 선택
#   ㄴ 검색이 되지 않았을 경우 구현
# 4. 학생성적정렬
#   ㄴ 이름으로 순차정렬
#   ㄴ 합계로 순차정렬
# 5. 학생성적검색
#   ㄴ 찾고자 하는 학생 검색 후 있으면 화면 출력
# 6. 등수처리
#   ㄴ 합계를 기준으로 등수처리 진행
# 0. 종료


